brew 'openssl' # needs to be installed first
brew 'autoconf'
brew 'ctags'
brew 'fzf'
brew 'gdbm'
brew 'git'
brew 'go', args: ['cross-compile-common']
brew 'heroku-toolbelt'
brew 'httpie'
brew 'jpeg'
brew 'libpng'
brew 'libtiff'
brew 'libyaml'
brew 'little-cms2'
brew 'node'
brew 'pcre'
brew 'perl'
brew 'pkg-config'
brew 'pyenv'
brew 'rbenv'
brew 'readline'
brew 'reattach-to-user-namespace' # fixes tmux on mac
brew 'ruby-build'
brew 'shellcheck'
brew 'sqlite'
brew 'the_silver_searcher'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'vim'
brew 'webp'
brew 'xz'
cask 'alfred'
cask 'atom'
cask 'dash'
cask 'dashlane' # password manager
cask 'dropbox'
cask 'caskroom/versions/firefoxdeveloperedition'
cask 'google-chrome'
cask 'iterm2'
cask 'karabiner-elements'
cask 'licecap'
cask 'mattermost'
cask 'near-lock'
cask 'postman'
cask 'sequel-pro'
cask 'slack'
cask 'tunnelbear'
cask 'typora'
cask 'virtualbox'
cask 'vagrant' # requires virtualbox
cask 'vagrant-manager'
cask 'vlc'
cask 'webtorrent'
